[
  {
    "version": "1.1.0",
    "changes": [
      {
        "type": "feat",
        "title": "Añadida sección para ver más detalles de los juegos",
        "description": "Se añadió una nueva sección para mostrar más detalles de los juegos, incluyendo una breve descripción y las diferentes versiones disponibles.",
        "scope": "web"
      },
      {
        "type": "feat",
        "title": "Mejorado el diseño de la web",
        "description": "Se ha mejorado el diseño visual de la web para hacerla más atractiva y fácil de usar.",
        "scope": "web"
      },
      {
        "type": "feat",
        "title": "Añadido soporte para ver más detalles de los juegos en el backend",
        "description": "Se añadió soporte en el backend para poder mostrar más detalles de los juegos, como una breve descripción y las distintas versiones disponibles.",
        "scope": "backend"
      }
    ]
  },
  {
    "version": "1.0.2",
    "changes": [
      {
        "type": "feat",
        "title": "Mejoras en el diseño de la web",
        "description": "Se mejoró la experiencia de usuario con cambios en el diseño de la sección de búsqueda de juegos y la sección del changelog.",
        "scope": "web"
      }
    ],
    "date": "24/12/2024"
  },
  {
    "version": "1.0.1",
    "changes": [
      {
        "type": "feat",
        "title": "Eliminado el impuesto país en la API",
        "description": "Se eliminó el impuesto país del cálculo final, ya que a partir de hoy este impuesto expiró y no fue renovado. Este cambio reduce un 8% los impuestos en compras realizadas con dólar tarjeta. No afecta a las compras con dólar MEP (que incluyen solo IVA) ni a las realizadas con criptomonedas (sin impuestos adicionales).",
        "scope": "backend"
      },
      {
        "type": "fix",
        "title": "Corrección de errores al buscar juegos",
        "description": "Se solucionó un problema donde no se mostraba un mensaje adecuado al no encontrar juegos. También se corrigió un fallo que ocasionalmente causaba el bloqueo de la página.",
        "scope": "web"
      }
    ],
    "date": "22/12/2024"
  },
  {
    "version": "1.0.0",
    "changes": [
      {
        "type": "release",
        "title": "Primera versión del proyecto",
        "description": "Lanzamiento oficial del proyecto, tanto en web, server como el Bot",
        "scope": "general"
      }
    ],
    "date": "17/12/2024"
  }
]